src/cf/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИнициалыИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФИОСлужебные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФамилияЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаВыдачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорииТранспортныхСредств</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименяетсяОсвобождениеОтУплатыНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОперации0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассифицироватьНоменклатуруПоОперациям0</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРегистрацииСчетовФактурНаАванс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогообложенияПриУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СистемыНалогообложенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СистемыНалогообложенияОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяПатент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикТорговыйСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяПродажаАлкоголя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяСтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДСПрименяющийУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПрименяемыеТарифыСтраховыхВзносовУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрименяемыеТарифыСтраховыхВзносовУНФ</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТарифовСтраховыхВзносовУНФ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлательщикСтраховыхВзносовПФР_ФФОМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИПТарифыФиксированныхВзносов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыСтавокНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСтавокНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нулевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУСНРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяУСНРасчетная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсобыйПорядок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУСН</Name>
					<Comment>Автоматизированная УСН</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/НачалоРаботыСПрограммойСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Добавляет необходимые параметры работы клиента при запуске.
//
// Параметры:
//	Параметры - Структура - заполняемые параметры;
//
Процедура ПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	Параметры.Вставить("ПоказатьОкноНачалоРаботыСПрограммой", ПоказатьОкноНачалоРаботыСПрограммой());
	Параметры.Вставить("ПоказатьВыборДемоПриложений", ПоказатьВыборДемоПриложений());
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПередЗапускомПрограммы
Процедура ПередЗапускомПрограммы() Экспорт
	
	Если ТекущийРежимЗапуска() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПоказатьОкноНачалоРаботыСПрограммой() Тогда
		УстановитьИнтерфейсНачалаРаботы();
		Возврат;
	КонецЕсли;
	
	Если ПоказатьВыборДемоПриложений() Тогда
		РабочийСтолУНФ.УстановитьПустуюНастройкуИнтерфейса();
		РабочийСтолУНФ.УстановитьПустуюНачальнуюСтраницу();
	КонецЕсли;
	
КонецПроцедуры

// Регистрирует обработчики поставляемых данных.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - таблица обработчиков.
//
Процедура ЗарегистрироватьОбработчикиПоставляемыхДанных(Знач Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ВидДанных = "Константа.ДатаПервогоВходаВСистему";
	Обработчик.КодОбработчика = 01;
	Обработчик.Обработчик = НачалоРаботыСПрограммойСервер;
	
КонецПроцедуры

// Вызывается при получении уведомления о новых данных.
// В теле следует проверить, необходимы ли эти данные приложению, 
// и если да - установить флажок Загружать
// 
// Параметры:
//   Дескриптор - Произвольный - Дескриптор
//   Загружать - Булево
//
Процедура ДоступныНовыеДанные(Знач Дескриптор, Загружать) Экспорт
	
	Если Дескриптор.DataType = "Константа.ДатаПервогоВходаВСистему" Тогда
		
		Загружать = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается после вызова ДоступныНовыеДанные, позволяет разобрать данные.
// @skip-check module-empty-method
//
// Параметры:
//   Дескриптор   - ОбъектXDTO - Дескриптор.
//   ПутьКФайлу   - Строка - Полное имя извлеченного файла. Файл будет автоматически удален 
//                  после завершения процедуры.
Процедура ОбработатьНовыеДанные(Знач Дескриптор, Знач ПутьКФайлу) Экспорт
	
КонецПроцедуры

// Вызывается при отмене обработки данных в случае сбоя
// @skip-check module-empty-method
// 
// Параметры:
//  Дескриптор - ОбъектXDTO - дескриптор
Процедура ОбработкаДанныхОтменена(Знач Дескриптор) Экспорт 
	
КонецПроцедуры

// Установить стандартный интерфейс.
// 
// Параметры:
//  ИмяПользователя - Неопределено, Строка - Имя пользователя
Процедура УстановитьСтандартныйИнтерфейс(ИмяПользователя = Неопределено) Экспорт
	
	Если ИмяПользователя = Неопределено Тогда
		
		ТекущийПользователь = Пользователи.АвторизованныйПользователь();
		
		УстановитьПривилегированныйРежим(Истина);
		ПрочитанныеСвойства = Пользователи.СвойстваПользователяИБ(ТекущийПользователь.ИдентификаторПользователяИБ);
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ПрочитанныеСвойства <> Неопределено Тогда
			
			ИмяПользователя = ПрочитанныеСвойства.Имя;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если (МобильноеПриложениеВызовСервера.ЕстьОграничениеМобильногоУНФ()
		И НЕ МобильноеПриложениеВызовСервера.ЕстьПробныйПериод())
		ИЛИ (МобильноеПриложениеВызовСервера.ЕстьОграничениеМобильногоУНФ20()
		И НЕ МобильноеПриложениеВызовСервера.ЕстьПробныйПериод()) Тогда
		РабочийСтолУНФ.УстановитьСоставФорм(, ИмяПользователя);
	Иначе
		
		Если ИмяПользователя = Неопределено Тогда
			РабочийСтолУНФ.УстановитьНачальнуюСтраницуИИнтерфейс();
		Иначе
			РабочийСтолУНФ.УстановитьНачальнуюСтраницуИИнтерфейс(ИмяПользователя);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Установить интерфейс начала работы.
// 
// Параметры:
//  ИмяФормы - Строка - Имя формы
Процедура УстановитьИнтерфейсНачалаРаботы(ИмяФормы = "") Экспорт
	
	РабочийСтолУНФ.УстановитьПустуюНастройкуИнтерфейса();
	
	Если ПустаяСтрока(ИмяФормы) Тогда
		ИмяФормы = "Обработка.НачалоРаботыСПрограммой.Форма";
	КонецЕсли;
	
	РабочийСтолУНФ.УстановитьФормуНаНачальнуюСтраницу(ИмяФормы);
	
КонецПроцедуры

// Обработка закрытия формы начала работы.
// 
// Параметры:
//  РезультатФормыНачалаРаботы - Структура
//  ПараметрыНачалаРаботы  - Структура
//  ОбработкаЗавершена - Булево
Процедура ОбработкаЗакрытияФормыНачалаРаботы(РезультатФормыНачалаРаботы, ПараметрыНачалаРаботы, ОбработкаЗавершена) Экспорт
	
	УстановитьИспользованиеНесколькихОрганизаций(РезультатФормыНачалаРаботы);
	
	НачатьТранзакцию();
	
	Попытка
		
		ОбновитьПользователя(РезультатФормыНачалаРаботы, ПараметрыНачалаРаботы);
		
		ВыполнитьЗаполнениеПоВидуБизнеса(РезультатФормыНачалаРаботы);
		
		ОбновитьЗаписатьОрганизации(РезультатФормыНачалаРаботы, Истина);
		
		ЗафиксироватьОкончаниеПервогоВходаВПрограмму(ПараметрыНачалаРаботы.ВерсияДанныхОсновнойКонфигурации);
		
		ОбработкаЗавершена = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Обработка закрытия формы начала работы при ошибке.
// 
// Параметры:
//  РезультатФормыНачалаРаботы - Структура - 
//  ПараметрыНачалаРаботы - Структура - 
// 
// Возвращаемое значение:
//  Структура - Результат закрытия формы начала работы при ошибке:
// * ПользовательСоздан - Булево - пользователь создан
Функция РезультатЗакрытияФормыНачалаРаботыПриОшибке(РезультатФормыНачалаРаботы, ПараметрыНачалаРаботы) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПользовательСоздан", Истина);
	
	Попытка
		НачатьТранзакцию();
		ОбновитьПользователя(РезультатФормыНачалаРаботы, ПараметрыНачалаРаботы);
	Исключение
		ОтменитьТранзакцию();
		Результат.ПользовательСоздан = Ложь;
	КонецПопытки;
	
	ВыполнитьЗаполнениеПоВидуБизнеса(РезультатФормыНачалаРаботы);
	ОбновитьЗаписатьОрганизации(РезультатФормыНачалаРаботы, Ложь);
	
	ЗафиксироватьОкончаниеПервогоВходаВПрограмму(ПараметрыНачалаРаботы.ВерсияДанныхОсновнойКонфигурации);
	
	Возврат Результат;
	
КонецФункции

// См. ИнформацияПриЗапускеПереопределяемый.ОпределитьНастройки
Процедура ОпределитьНастройкиИнформацияПриЗапуске(Настройки) Экспорт
	Если Настройки.Показывать = Истина Тогда
		Настройки.Показывать = Не ПоказатьОкноНачалаРаботыИлиВыбораДемоПриложений();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ДанныеОрганизацииСервиса

Функция ПолучитьДанныеОрганизацииССервиса() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИНН", "");
	Результат.Вставить("ДанныеГосРеестра", Неопределено);
	
	Попытка
		
		ИНН = ИННПользователяСервиса();
		Если ИНН = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		Результат.ИНН = ИНН;
		Результат.ДанныеГосРеестра = ДанныеГосРеестра(ИНН);
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
		НачалоРаботыСПрограммойКлиентСервер.ИмяСобытияЖР(),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Обработки.НачалоРаботыСПрограммой, ,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ИННПользователяСервиса() Экспорт
	
	СведенияАбонента = ПрограммныйИнтерфейсСервиса.ДополнительныеСведенияАбонента();
	
	ПубличныйИдентификатор = Неопределено;
	СведенияАбонента.Свойство("ПубличныйИдентификатор", ПубличныйИдентификатор);
	Если ТипЗнч(ПубличныйИдентификатор) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИдентификаторАбонента = СокрЛП(ПубличныйИдентификатор);
	ДлинаИНН = СтрДлина(ИдентификаторАбонента);
	ЭтоЮрЛицо = (ДлинаИНН = 10);
	
	ОписаниеОшибки = "";
	ИННВведенКорректно = РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(
	ИдентификаторАбонента, ЭтоЮрЛицо, ОписаниеОшибки);
	Если Не ИННВведенКорректно Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ИдентификаторАбонента;
	
КонецФункции

Функция ДанныеГосРеестра(ИНН) Экспорт
	
	Результат = Новый Структура;
	
	ЭтоЮрЛицо = ?(СтрДлина(ИНН) = 12, Ложь, Истина);
	
	Если ЭтоЮрЛицо Тогда
		ЗначениеРеквизитов = РаботаСКонтрагентами.СведенияОЮридическомЛицеПоИНН(ИНН);
	Иначе
		ЗначениеРеквизитов = РаботаСКонтрагентами.РеквизитыПредпринимателяПоИНН(ИНН);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеРеквизитов.ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Неопределено, , ЗначениеРеквизитов.ОписаниеОшибки, "");
		Возврат Результат;
	КонецЕсли;
	
	Результат.Вставить("ЭтоЮрЛицо", ЭтоЮрЛицо);
	Результат.Вставить("ИНН", ЗначениеРеквизитов.ИНН);
	Результат.Вставить("СведенияПолучены", Ложь);
	Если ЭтоЮрЛицо Тогда
		
		Если ЗначениеРеквизитов.ЕГРЮЛ = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		Результат.СведенияПолучены = Истина;
		Результат.Вставить("Наименование", ЗначениеРеквизитов.ЕГРЮЛ.Наименование);
		Результат.Вставить("НаименованиеПолное", ЗначениеРеквизитов.ЕГРЮЛ.НаименованиеПолное);
		Результат.Вставить("НаименованиеСокращенное", ЗначениеРеквизитов.ЕГРЮЛ.НаименованиеСокращенное);
		Результат.Вставить("ОГРН", ЗначениеРеквизитов.ЕГРЮЛ.РегистрационныйНомер);
		Результат.Вставить("КПП", ЗначениеРеквизитов.ЕГРЮЛ.КПП);
		Результат.Вставить("ЮридическийАдрес", ЗначениеРеквизитов.ЕГРЮЛ.ЮридическийАдрес);
		
		Телефон = Неопределено;
		ЗначениеРеквизитов.ЕГРЮЛ.Свойство("Телефон", Телефон);
		Результат.Вставить("Телефон", Телефон);
		
		Если ЗначениеРеквизитов.ЕГРЮЛ.ВидДеятельности <> Неопределено Тогда
			Результат.Вставить("КодОКВЭД", ЗначениеРеквизитов.ЕГРЮЛ.ВидДеятельности.Код);
		Иначе
			Результат.Вставить("КодОКВЭД", Неопределено);
		КонецЕсли;
		
		ЮридическийАдресПоИНН = ЗначениеРеквизитов.ЕГРЮЛ.ЮридическийАдрес;
		ДанныеПоИННРегистрацияВНалоговомОргане = ЗначениеРеквизитов.ЕГРЮЛ.РегистрацияВНалоговомОргане;
		ДанныеПоИННРегистрацияВПенсионномФонде = ЗначениеРеквизитов.ЕГРЮЛ.РегистрацияВПенсионномФонде;
		ДанныеПоИННРегистрацияВФСС = ЗначениеРеквизитов.ЕГРЮЛ.РегистрацияВФСС;
		
	Иначе
		
		Результат.СведенияПолучены = Истина;
		Результат.Вставить("Наименование", ЗначениеРеквизитов.Наименование);
		Результат.Вставить("НаименованиеПолное", ЗначениеРеквизитов.НаименованиеПолное);
		Результат.Вставить("НаименованиеСокращенное", ЗначениеРеквизитов.НаименованиеСокращенное);
		Результат.Вставить("ОГРН", ЗначениеРеквизитов.РегистрационныйНомер);
		Результат.Вставить("КодОКВЭД", Неопределено);
		Результат.Вставить("ЮридическийАдрес", Неопределено);
		Результат.Вставить("Телефон", Неопределено);
		
		Результат.Вставить("СвидетельствоСерияНомер", Неопределено);
		Результат.Вставить("СвидетельствоДатаВыдачи", Неопределено);
		Если ЗначениеРеквизитов.СвидетельствоОРегистрации <> Неопределено Тогда
			
			СвидетельствоСерияНомер = "" 
			+ ЗначениеРеквизитов.СвидетельствоОРегистрации.Серия + " " + ЗначениеРеквизитов.СвидетельствоОРегистрации.Номер;
			СвидетельствоДатаВыдачи = ЗначениеРеквизитов.СвидетельствоОРегистрации.Дата;
			
			Результат.Вставить("СвидетельствоСерияНомер", СвидетельствоСерияНомер);
			Результат.Вставить("СвидетельствоДатаВыдачи", СвидетельствоДатаВыдачи);
			
		КонецЕсли;
		
		Результат.Вставить("Фамилия", ЗначениеРеквизитов.Фамилия);
		Результат.Вставить("Имя", ЗначениеРеквизитов.Имя);
		Результат.Вставить("Отчество", ЗначениеРеквизитов.Отчество);
		Результат.Вставить("Пол", 
		?(ЗначениеРеквизитов.Пол = "1", Перечисления.ПолФизическогоЛица.Мужской, Перечисления.ПолФизическогоЛица.Женский));
		
		ДанныеПоИННРегистрацияВНалоговомОргане = ЗначениеРеквизитов.РегистрацияВНалоговомОргане;
		ДанныеПоИННРегистрацияВПенсионномФонде = ЗначениеРеквизитов.РегистрацияВПенсионномФонде;
		ДанныеПоИННРегистрацияВФСС = ЗначениеРеквизитов.РегистрацияВФСС;
		
	КонецЕсли;
	
	Результат.Вставить("ЮридическоеФизическоеЛицо", ?(ЭтоЮрЛицо, Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо, Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо));
	
	Результат.Вставить("КодНалоговогоОргана", Неопределено);
	Результат.Вставить("КодНалоговогоОрганаПолучателя", Неопределено);
	Результат.Вставить("КодОрганаПФР", Неопределено);
	Результат.Вставить("РегистрационныйНомерПФР", Неопределено);
	Результат.Вставить("РегистрационныйНомерПФР_ИП", Неопределено);
	
	// Устанавливаем сведения о налоговой инспекции
	// В том случае, если указан юридический адрес, получаем код налоговой инспекции по адресу
	// и заполняем реквизиты инспекции по коду
	// В том случае, если юридического адреса нет - заполняем данные о налоговой инспекции
	// из кода в ЕГРЮЛ/ЕГРИП
	Если ЗначениеЗаполнено(ЮридическийАдресПоИНН) Тогда
		
		ОписаниеОшибкиАдрес = "";
		ЗаполнитьСведенияОНалоговойИнспекцииПоАдресу(ЮридическийАдресПоИНН, Результат, ОписаниеОшибкиАдрес);
		
		Если ЗначениеЗаполнено(ОписаниеОшибкиАдрес)
			И ЗначениеЗаполнено(ДанныеПоИННРегистрацияВНалоговомОргане)
			И ЗначениеЗаполнено(ДанныеПоИННРегистрацияВНалоговомОргане.Код) Тогда
			
			Результат.Вставить("КодНалоговогоОргана", ДанныеПоИННРегистрацияВНалоговомОргане.Код);
			ЗаполнитьСведенияОНалоговойИнспекцииПоКоду(Результат);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеПоИННРегистрацияВНалоговомОргане) Тогда
		
		Результат.Вставить("КодНалоговогоОрганаПолучателя", ДанныеПоИННРегистрацияВНалоговомОргане.Код);
		ЗаполнитьСведенияОНалоговойИнспекцииПоКоду(Результат);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПоИННРегистрацияВПенсионномФонде) Тогда
		
		Ключ = "РегистрационныйНомерПФР" + ?(ЭтоЮрЛицо, "", "_ИП");
		
		Результат.Вставить("КодОрганаПФР", ДанныеПоИННРегистрацияВПенсионномФонде.КодОрганаПФР);
		Результат.Вставить(Ключ, ДанныеПоИННРегистрацияВПенсионномФонде.РегистрационныйНомерПФР);
		
		ЗаполнитьСведенияОбОтделенииПФР(Результат);
		
	КонецЕсли;
	
	Результат.Вставить("КодОрганаФСС", Неопределено);
	Результат.Вставить("НаименованиеТерриториальногоОрганаФСС", Неопределено);
	Результат.Вставить("РегистрационныйНомерФСС", Неопределено);
	Результат.Вставить("ПлатежныеРеквизитыФССПредставление", Неопределено);
	Результат.Вставить("НаименованиеТерриториальногоОрганаФСС", Неопределено);
	
	Если ЗначениеЗаполнено(ДанныеПоИННРегистрацияВФСС) Тогда
		
		Результат.Вставить("КодОрганаФСС", ДанныеПоИННРегистрацияВФСС.КодОрганаФСС);
		Результат.Вставить("НаименованиеТерриториальногоОрганаФСС", ДанныеПоИННРегистрацияВФСС.НаименованиеОрганаФСС);
		Результат.Вставить("РегистрационныйНомерФСС", ДанныеПоИННРегистрацияВФСС.РегистрационныйНомерФСС);
		
		ЗаполнитьСведенияОбОтделенииФСС(Результат);
		
	КонецЕсли;
	
	Если ПустаяСтрока(Результат.Наименование) Тогда
		Если Не ПустаяСтрока(Результат.НаименованиеПолное) Тогда
			Результат.Наименование = Результат.НаименованиеПолное;
		Иначе
			Результат.Наименование = Результат.НаименованиеСокращенное;
		КонецЕсли;
	КонецЕсли;
	
	Результат.Вставить(
	"НаименованиеПлательщикаПриПеречисленииНалогов", НаименованиеПлательщикаПоУмолчанию(Результат));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Процедура ЗафиксироватьОкончаниеПервогоВходаВПрограмму(ВерсияКонфигурации) Экспорт
	
	Константы.ДатаПервогоВходаВСистему.Установить(ТекущаяДатаСеанса());
	Константы.ВерсияНачалаРаботыСПрограммой.Установить(ВерсияКонфигурации);
	
КонецПроцедуры

Функция ПервыйВходВПрограммуЗафиксирован() Экспорт
	
	ДатаПервогоВходаЗафиксирована = ЗначениеЗаполнено(Константы.ДатаПервогоВходаВСистему.Получить());
	Если ДатаПервогоВходаЗафиксирована Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПользовательЗаведен = Не ОбщегоНазначения.РазделениеВключено() И Не ПользовательПустой(Пользователи.АвторизованныйПользователь());
	Возврат ПользовательЗаведен;
	
КонецФункции

Процедура УстановитьВыборДемоПриложений() Экспорт
	
	ИмяФормы = "Обработка.БизнесПриложения.Форма.ВыборДемоПриложений";
	РабочийСтолУНФ.УстановитьФормуНаНачальнуюСтраницу(ИмяФормы);
	
КонецПроцедуры

Функция ПоказатьОкноНачалоРаботыСПрограммой() Экспорт
	
	Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВозможностиПриложения.ЭтоДемоПриложение() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПервыйВходВПрограммуЗафиксирован() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.РазделениеВключено() И Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДанныхПриСтарте

Процедура УстановитьИспользованиеНесколькихОрганизаций(ЗначенияРеквизитов)
	
	КоличествоОрганизаций = ЗначенияРеквизитов.Организации.Количество();
	Если КоличествоОрганизаций > 1 Тогда
		Константы.ИспользоватьНесколькоОрганизаций.Установить(Истина);
		Константы.НеИспользоватьНесколькоОрганизаций.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьПользователя(ЗначенияРеквизитов, ПараметрыНачалаРаботы)
	
	Если Не ЗначениеЗаполнено(ЗначенияРеквизитов.Пользователь) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыНачалаРаботы.РазделениеВключено Тогда
		
		ПользовательОбъект = ЗначенияРеквизитов.Пользователь.ПолучитьОбъект();
		ПользовательОбъект.Заблокировать();
		
	Иначе
		
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		
		// Доступно только в локальном режиме
		ПользовательОбъект.Наименование = ЗначенияРеквизитов.ПользовательИмя;
		
		ОписаниеПользователяИБ = Новый Структура;
		ОписаниеПользователяИБ.Вставить("Действие", "Записать");
		ОписаниеПользователяИБ.Вставить("Имя", ЗначенияРеквизитов.ПользовательИмя);
		ОписаниеПользователяИБ.Вставить("ПолноеИмя", ЗначенияРеквизитов.ПользовательИмя);
		ОписаниеПользователяИБ.Вставить("Пароль", ЗначенияРеквизитов.ПользовательПароль);
		ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", Истина);
		ОписаниеПользователяИБ.Вставить("ПарольУстановлен", Истина);
		ОписаниеПользователяИБ.Вставить("ПоказыватьВСпискеВыбора", Истина);
		
		ДоступныеРоли = Новый Массив;
		ДоступныеРоли.Добавить(Метаданные.Роли.АдминистраторСистемы.Имя);
		ДоступныеРоли.Добавить(Метаданные.Роли.ПолныеПрава.Имя);
		
		ОписаниеПользователяИБ.Вставить("Роли", ДоступныеРоли);
		
		ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
		ПользовательОбъект.ДополнительныеСвойства.Вставить("СозданиеАдминистратора", НСтр(
			"ru = 'Создание первого администратора.'"));
		
		ПользовательОбъект.Служебный = Ложь;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ЗначенияРеквизитов.ПользовательТелефон) Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ПользовательОбъект,
			ЗначенияРеквизитов.ПользовательТелефон, ВидКИ);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ЗначенияРеквизитов.ПользовательEmail) Тогда
		ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ПользовательОбъект,
			ЗначенияРеквизитов.ПользовательEmail, ВидКИ);
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПользовательОбъект, Ложь, Истина);
	
	Если ЗначенияРеквизитов.Свойство("РазрешитьИнтерактивноеОткрытие") Тогда
		Пользователи.УстановитьПравоОткрытияВнешнихОтчетовИОбработок(
			ЗначенияРеквизитов.РазрешитьИнтерактивноеОткрытие);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьЗаполнениеПоВидуБизнеса(ЗначенияРеквизитов)
	
	Если НЕ ЗначенияРеквизитов.Свойство("ВидБизнесаОрганизации")
		ИЛИ ТипЗнч(ЗначенияРеквизитов.ВидБизнесаОрганизации) <> Тип("СписокЗначений")
		ИЛИ ЗначенияРеквизитов.ВидБизнесаОрганизации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ВсеИдентификаторы = "";
		Для каждого ВидБизнеса Из ЗначенияРеквизитов.ВидБизнесаОрганизации Цикл
			
			ИдентификаторВидаБизнеса = ИдентификаторВидаБизнеса(ВидБизнеса.Значение);
			Если ИдентификаторВидаБизнеса = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ВсеИдентификаторы <> "" Тогда
				ВсеИдентификаторы = ВсеИдентификаторы + ";";
			КонецЕсли;
			ВсеИдентификаторы = ВсеИдентификаторы + ИдентификаторВидаБизнеса;
			
			ЗаполнитьНастройкиПоВидуБизнеса(ВидБизнеса.Значение);
			
		КонецЦикла;
		
		Если ВсеИдентификаторы <> "" Тогда
			Константы.ВидБизнесаОрганизации.Установить(ВсеИдентификаторы);
		КонецЕсли;
		
	Исключение
		
		// Не вызывать исключение, чтобы не нагружать пользователя при старте.
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
		НачалоРаботыСПрограммойКлиентСервер.ИмяСобытияЖР(), УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьЗаписатьОрганизации(ЗначенияРеквизитов, ВыбрасыватьОшибку)
	
	// ЗначенияРеквизитов.Организации.Выгрузить() - в толстом приводит к ошибке
	ТаблицаОрганизаций = Обработки.НачалоРаботыСПрограммой.Создать().Организации.Выгрузить();
	КоличествоОрганизаций = ЗначенияРеквизитов.Организации.Количество();
	Для Счетчик = 0 По КоличествоОрганизаций - 1 Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОрганизаций.Добавить(), ЗначенияРеквизитов.Организации[Счетчик]);
	КонецЦикла;
	
	Для Каждого СтрокаОрганизации Из ТаблицаОрганизаций Цикл
		
		НачатьТранзакцию();
		
		Попытка
		
			ОрганизацияОбъект = СтрокаОрганизации.Ссылка.ПолучитьОбъект();
			Если ОрганизацияОбъект = Неопределено Тогда
				ОрганизацияОбъект = Справочники.Организации.СоздатьЭлемент();
				ОрганизацияОбъект.УстановитьСсылкуНового(СтрокаОрганизации.Ссылка);
				ОрганизацияОбъект.ПроизводственныйКалендарь = ГрафикиРаботыУНФ.КалендарьПоПроизводственномуКалендарюРФ();
			КонецЕсли;
			ОрганизацияОбъект.Заблокировать();
			
			СНО = СтрокаОрганизации.СистемаНалогообложения;
			ЭтоОбщаяСНО = СтрНайти(СНО, "ОСНО");
			ЭтоАУСН = СтрНайти(СНО, "АУСН");
			ЭтоУСН = СтрНайти(СНО, "УСН") И Не ЭтоАУСН;
			ЭтоПатент = (СНО = "ПСН");
			ПрименяетсяПатент = СтрНайти(СНО, "ПСН");
			ПрименяетсяНДС = СтрНайти(СНО, "НДС");
			НачалоМесяца = НачалоМесяца(ТекущаяДатаСеанса());
			
			Если ЭтоОбщаяСНО Тогда
				ОрганизацияОбъект.ВидСтавкиНДСПоУмолчанию = Перечисления.ВидыСтавокНДС.Общая;
			Иначе
				ОрганизацияОбъект.ВидСтавкиНДСПоУмолчанию = Перечисления.ВидыСтавокНДС.БезНДС;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ОрганизацияОбъект, СтрокаОрганизации);
			
			Если ОрганизацияОбъект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
				
				ОрганизацияОбъект.ИспользуетсяОтчетность = ЭтоАУСН Или ЭтоУСН;
				
				ФизическоеЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
				ФизическоеЛицо.Наименование = СтрокаОрганизации.ФИО;
				ФизическоеЛицо.Записать();
				ОрганизацияОбъект.ФизическоеЛицо = ФизическоеЛицо.Ссылка;
				
				ЧастиФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(СтрокаОрганизации.ФИО);
				
				МенеджерЗаписиФизЛица = РегистрыСведений.ФИОФизическихЛиц.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписиФизЛица, ЧастиФИО, "Фамилия, Имя, Отчество");
				МенеджерЗаписиФизЛица.Период = '19800101';
				МенеджерЗаписиФизЛица.ФизическоеЛицо = ФизическоеЛицо.Ссылка;
				МенеджерЗаписиФизЛица.Записать(Истина);
				
				МенеджерЗаписиДокументыФизЛиц = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
				МенеджерЗаписиДокументыФизЛиц.Период = '19800101';
				МенеджерЗаписиДокументыФизЛиц.ФизЛицо = ФизическоеЛицо.Ссылка;
				МенеджерЗаписиДокументыФизЛиц.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ;
				МенеджерЗаписиДокументыФизЛиц.ЯвляетсяДокументомУдостоверяющимЛичность = Истина;
				МенеджерЗаписиДокументыФизЛиц.Записать(Истина);
				
			КонецЕсли;
			
			ЗаполнитьКонтактнуюИнформациюОрганизации(
			ОрганизацияОбъект, ЗначенияРеквизитов.КонтактнаяИнформацияОрганизаций, СтрокаОрганизации.ИндексОрганизации);
			ОрганизацияОбъект.Записать();
			
			Если ЭтоУСН И ПрименяетсяНДС Тогда
				
				МенеджерЗаписи = РегистрыСведений.НастройкиУчетаНДС.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = НачалоМесяца;
				МенеджерЗаписи.Организация = СтрокаОрганизации.Ссылка;
				МенеджерЗаписи.СтавкаНалогообложенияПриУСН = СтрокаОрганизации.СтавкаНДС;
				МенеджерЗаписи.Записать();
				
			КонецЕсли;
			
			МенеджерЗаписи = РегистрыСведений.СистемыНалогообложенияОрганизаций.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = '20000101';
			МенеджерЗаписи.Организация = СтрокаОрганизации.Ссылка;
			МенеджерЗаписи.ПрименяетсяПатент = ПрименяетсяПатент;
			
			Если ЭтоОбщаяСНО Тогда
				
				МенеджерЗаписи.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая;
				МенеджерЗаписи.ПлательщикУСН = Ложь;
				
			ИначеЕсли ЭтоУСН Тогда
				
				МенеджерЗаписи.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная;
				МенеджерЗаписи.ПлательщикУСН = Истина;
				МенеджерЗаписи.ОбъектНалогообложения = СтрокаОрганизации.ВидыОбъектовНалогообложения;
				МенеджерЗаписи.СтавкаНалога = СтрокаОрганизации.СтавкаНалога;
				
			ИначеЕсли ЭтоПатент Тогда
				
				МенеджерЗаписи.СистемаНалогообложения = Перечисления.СистемыНалогообложения.ОсобыйПорядок;
				МенеджерЗаписи.ПлательщикУСН = Ложь;
				
			ИначеЕсли ЭтоАУСН Тогда
				
				МенеджерЗаписи.СистемаНалогообложения = Перечисления.СистемыНалогообложения.АУСН;
				МенеджерЗаписи.ПлательщикУСН = Ложь;
				МенеджерЗаписи.ПрименяетсяАУСН = Истина;
				МенеджерЗаписи.ПрименяетсяПатент = Ложь;
				МенеджерЗаписи.ОбъектНалогообложения = СтрокаОрганизации.ВидыОбъектовНалогообложения;
				МенеджерЗаписи.СтавкаНалога = СтрокаОрганизации.СтавкаНалога
				
			КонецЕсли;
			
			МенеджерЗаписи.Записать(Истина);
			
			Если ЭтоУСН И ПрименяетсяНДС Тогда
				
				ЗаписьПрименениеНДС = РегистрыСведений.СистемыНалогообложенияОрганизаций.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(ЗаписьПрименениеНДС, МенеджерЗаписи);
				ЗаписьПрименениеНДС.ПлательщикНДСПрименяющийУСН = Истина;
				ЗаписьПрименениеНДС.Период = НачалоМесяца;
				ЗаписьПрименениеНДС.Записать();
				
			КонецЕсли;
			
			Если ЭтоАУСН Тогда
				
				МенеджерЗаписи = РегистрыСведений.ПрименяемыеТарифыСтраховыхВзносовУНФ.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = НачалоМесяца;
				МенеджерЗаписи.ГоловнаяОрганизация = СтрокаОрганизации.Ссылка;
				МенеджерЗаписи.ВидТарифа = Справочники.ВидыТарифовСтраховыхВзносовУНФ.АУСН;
				МенеджерЗаписи.Записать();
			
			КонецЕсли;
			
			//НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Организация", СтрокаОрганизации.Ссылка);
			
			МенеджерЗаписи = РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.СоздатьМенеджерЗаписи();
			РегистрыСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.УстановкаНастроекПоУмолчанию(
			МенеджерЗаписи, ДанныеЗаполнения);
			МенеджерЗаписи.Организация = СтрокаОрганизации.Ссылка;
			МенеджерЗаписи.Период = '20000101';
			МенеджерЗаписи.Записать(Истина);
			//НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			Если ВыбрасыватьОшибку Тогда
				ВызватьИсключение;
			Иначе
				
				ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(
				НСтр(НачалоРаботыСПрограммойКлиентСервер.ИмяСобытияЖР(), ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ТекстОшибки);
				
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКонтактнуюИнформациюОрганизации(ОрганизацияОбъект, КИОрганизаций, ИндексОрганизации)
	
	НоваяКонтактнаяИнформация = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
	
	КИОрганизации = Новый Соответствие;
	СписокКИОрганизации = КИОрганизаций.НайтиСтроки(Новый Структура("ИндексОрганизации", ИндексОрганизации));
	Для Каждого ДанныеКИ Из СписокКИОрганизации Цикл
		КИОрганизации[ДанныеКИ.Вид] = ДанныеКИ;
	КонецЦикла;
	
	СтрокаКИ = КИОрганизации[Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации];
	Если СтрокаКИ <> Неопределено Тогда
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = СтрокаКИ.Представление;
		ДанныеКИ.Значение = СтрокаКИ.Значение;
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	КонецЕсли;
	
	СтрокаКИ = КИОрганизации[Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации];
	Если СтрокаКИ <> Неопределено Тогда
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = СтрокаКИ.Представление;
		ДанныеКИ.Значение = СтрокаКИ.Значение;
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
	КонецЕсли;
	
	СтрокаКИ = КИОрганизации[Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации];
	Если СтрокаКИ <> Неопределено Тогда
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = СтрокаКИ.Представление;
		ДанныеКИ.Значение = СтрокаКИ.Значение;
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации;
	КонецЕсли;
	
	СтрокаКИ = КИОрганизации[Справочники.ВидыКонтактнойИнформации.СайтОрганизации];
	Если СтрокаКИ <> Неопределено Тогда
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = СтрокаКИ.Представление;
		ДанныеКИ.Значение = СтрокаКИ.Значение;
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.СайтОрганизации;
	КонецЕсли;
	
	Если НоваяКонтактнаяИнформация.Количество() Тогда
		УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(
		ОрганизацияОбъект, НоваяКонтактнаяИнформация, Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиПоВидуБизнеса(ВидБизнеса)
	
	Если НЕ ЗначениеЗаполнено(ВидБизнеса) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидБизнеса = "ОптоваяТорговля" Тогда
		
		Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Установить(Истина);
		Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиЗакупки.Установить(Истина);
		Константы.ФункциональнаяОпцияИспользоватьСверкиВзаиморасчетов.Установить(Истина);
		
	ИначеЕсли ВидБизнеса = "РозничнаяТорговля" Тогда
		
		Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Установить(Истина);
		Константы.ФункциональнаяОпцияИспользоватьПечатьЭтикетокИЦенников.Установить(Истина);
		Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Установить(Истина);
		Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиЗакупки.Установить(Истина);
		Константы.ФункциональнаяОпцияИспользоватьДисконтныеКарты.Установить(Истина);
		Константы.ФункциональнаяОпцияИспользоватьАвтоматическиеСкидкиНаценки.Установить(Истина);
		ДисконтныеКартыУНФСервер.ПроверитьИСоздатьУсловиеПоДисконтнойКарте();
		
	ИначеЕсли ВидБизнеса = "РаботыУслуги" Тогда
		
		Константы.ФункциональнаяОпцияИспользоватьПодсистемуРаботы.Установить(Истина);
		
	ИначеЕсли ВидБизнеса = "ИнтернетМагазин" Тогда
		
		Константы.ИспользоватьИнтеграциюСИнтернетМагазином.Установить(Истина);
		
	ИначеЕсли ВидБизнеса = "Производство" Тогда
		
		Константы.ФункциональнаяОпцияИспользоватьПодсистемуПроизводство.Установить(Истина);
		Константы.ФункциональнаяОпцияИспользоватьТехоперации.Установить(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИдентификаторВидаБизнеса(ВыбранныйВидБизнеса)
	
	ВидыБизнеса = ВидыБизнеса();
	
	Для каждого ВидБизнеса Из ВидыБизнеса Цикл
		Если ВидБизнеса.Код = ВыбранныйВидБизнеса Тогда
			Возврат ВидБизнеса.Идентификатор;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВидыБизнеса()
	
	ВидыБизнеса = Новый Массив;
	
	ВидБизнесаОписание = Новый Структура;
	ВидБизнесаОписание.Вставить("Представление", НСтр("ru='Оптовая торговля'"));
	ВидБизнесаОписание.Вставить("Код",           "ОптоваяТорговля");
	ВидБизнесаОписание.Вставить("Идентификатор", "72c52f8c-ef35-46ec-9aa1-bf666b4dc336");
	ВидыБизнеса.Добавить(ВидБизнесаОписание);
	
	ВидБизнесаОписание = Новый Структура;
	ВидБизнесаОписание.Вставить("Представление", НСтр("ru='Розница'"));
	ВидБизнесаОписание.Вставить("Код",           "РозничнаяТорговля");
	ВидБизнесаОписание.Вставить("Идентификатор", "4d9eaf34-2c37-43d3-9fa0-d2611144a805");
	ВидыБизнеса.Добавить(ВидБизнесаОписание);
	
	ВидБизнесаОписание = Новый Структура;
	ВидБизнесаОписание.Вставить("Представление", НСтр("ru='Работы и услуги'"));
	ВидБизнесаОписание.Вставить("Код",           "РаботыУслуги");
	ВидБизнесаОписание.Вставить("Идентификатор", "fde119b3-1c23-4415-83d0-e19e527a2c26");
	ВидыБизнеса.Добавить(ВидБизнесаОписание);
	
	ВидБизнесаОписание = Новый Структура;
	ВидБизнесаОписание.Вставить("Представление", НСтр("ru='Интернет-магазин'"));
	ВидБизнесаОписание.Вставить("Код",           "ИнтернетМагазин");
	ВидБизнесаОписание.Вставить("Идентификатор", "13df7e69-33d5-4eba-b300-691b2d12ebf9");
	ВидыБизнеса.Добавить(ВидБизнесаОписание);
	
	ВидБизнесаОписание = Новый Структура;
	ВидБизнесаОписание.Вставить("Представление", НСтр("ru='Производство'"));
	ВидБизнесаОписание.Вставить("Код",           "Производство");
	ВидБизнесаОписание.Вставить("Идентификатор", "123040c0-72e1-4eeb-b4c5-fc7d9ecb1e0a");
	ВидыБизнеса.Добавить(ВидБизнесаОписание);
	
	Возврат ВидыБизнеса;
	
КонецФункции

#КонецОбласти

#Область ДанныеПользователяСервиса

Процедура ЗаполнитьСведенияОбОтделенииПФР(ДанныеГосРеестра, ОписаниеОшибки = "")
	
	Если НЕ ЗначениеЗаполнено(ДанныеГосРеестра.КодОрганаПФР) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОтделенияПФР = ДанныеГосударственныхОрганов.РеквизитыОтделенияПФРПоКоду(
	Лев(ДанныеГосРеестра.КодОрганаПФР, 3));
	
	Если ЗначениеЗаполнено(РеквизитыОтделенияПФР.ОписаниеОшибки) Тогда
		ОписаниеОшибки = РеквизитыОтделенияПФР.ОписаниеОшибки;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РеквизитыОтделенияПФР.Ссылка) Тогда
		ДанныеГосударственныхОрганов.ОбновитьДанныеГосударственногоОргана(РеквизитыОтделенияПФР);
	КонецЕсли;
	
	ПлатежныеРеквизитыПФРПредставление =
	ДанныеГосударственныхОрганов.ПредставлениеПлатежныхРеквизитовГосударственногоОргана(РеквизитыОтделенияПФР);
	ДанныеГосРеестра.Вставить("ПлатежныеРеквизитыПФРПредставление", ПлатежныеРеквизитыПФРПредставление);
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОбОтделенииФСС(ДанныеГосРеестра, ОписаниеОшибки = "")
	
	Если НЕ ЗначениеЗаполнено(ДанныеГосРеестра.КодОрганаФСС) Тогда
		Возврат;
	КонецЕсли;
	
	КодПодчиненностиФСС = ДанныеГосРеестра.КодОрганаФСС + ?(ДанныеГосРеестра.ЭтоЮрЛицо, 1, 3);
	РеквизитыОтделенияФСС = ДанныеГосударственныхОрганов.РеквизитыОтделенияФССПоКоду(КодПодчиненностиФСС);
	
	Если ЗначениеЗаполнено(РеквизитыОтделенияФСС.ОписаниеОшибки) Тогда
		ОписаниеОшибки = РеквизитыОтделенияФСС.ОписаниеОшибки;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РеквизитыОтделенияФСС.Ссылка) Тогда
		ДанныеГосударственныхОрганов.ОбновитьДанныеГосударственногоОргана(РеквизитыОтделенияФСС);
	КонецЕсли;
	
	ПлатежныеРеквизитыФССПредставление = 
	ДанныеГосударственныхОрганов.ПредставлениеПлатежныхРеквизитовГосударственногоОргана(РеквизитыОтделенияФСС);
	ДанныеГосРеестра.Вставить("ПлатежныеРеквизитыФССПредставление", ПлатежныеРеквизитыФССПредставление);
	ДанныеГосРеестра.Вставить("НаименованиеТерриториальногоОрганаФСС", РеквизитыОтделенияФСС.Наименование);
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОНалоговойИнспекцииПоКоду(ДанныеГосРеестра, ОписаниеОшибки = "")
	
	Если НЕ ЗначениеЗаполнено(ДанныеГосРеестра.КодНалоговогоОрганаПолучателя) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыНалоговогоОргана = 
	ДанныеГосударственныхОрганов.РеквизитыНалоговогоОрганаПоКоду(ДанныеГосРеестра.КодНалоговогоОрганаПолучателя);
	
	Если ЗначениеЗаполнено(РеквизитыНалоговогоОргана.ОписаниеОшибки) Тогда
		ОписаниеОшибки = РеквизитыНалоговогоОргана.ОписаниеОшибки;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РеквизитыНалоговогоОргана.Ссылка) Тогда
		ДанныеГосударственныхОрганов.ОбновитьДанныеГосударственногоОргана(РеквизитыНалоговогоОргана);
	КонецЕсли;
	
	РегистрацияВНалоговомОргане = Новый Структура;
	РегистрацияВНалоговомОргане.Вставить("Наименование", РеквизитыНалоговогоОргана.Наименование);
	РегистрацияВНалоговомОргане.Вставить("НаименованиеИФНС", РеквизитыНалоговогоОргана.ПолноеНаименование);
	
	ДанныеГосРеестра.Вставить("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОНалоговойИнспекцииПоАдресу(ЮридическийАдресПоИНН, ДанныеГосРеестра, ОписаниеОшибки = "")
	
	ЭтоФизЛицо = НЕ ДанныеГосРеестра.ЭтоЮрЛицо;
	ЗначенияПолейАдреса = ЮридическийАдресПоИНН.КонтактнаяИнформация;
	
	Если НЕ ЗначениеЗаполнено(ЗначенияПолейАдреса) Тогда
		Возврат;
	КонецЕсли;
	
	СведенияОНалоговомОрганеПоАдресу = ДанныеАдресногоКлассификатора.НалоговыйОрганПоАдресу(ЗначенияПолейАдреса);
	
	Если СведенияОНалоговомОрганеПоАдресу = Неопределено Тогда
		КодНалоговогоОрганаПолучателя = "";
	Иначе
		КодНалоговогоОрганаПолучателя = ?(ЭтоФизЛицо, 
		СведенияОНалоговомОрганеПоАдресу.КодНалоговойДляФизическихЛиц,
		СведенияОНалоговомОрганеПоАдресу.КодНалоговойДляЮридическихЛиц);
	КонецЕсли;
	
	ДанныеГосРеестра.Вставить("КодНалоговогоОрганаПолучателя", КодНалоговогоОрганаПолучателя);
	
	ЗаполнитьСведенияОНалоговойИнспекцииПоКоду(ДанныеГосРеестра);
	
	Если СведенияОНалоговомОрганеПоАдресу <> Неопределено Тогда
		ДанныеГосРеестра.РегистрацияВНалоговомОргане.Вставить("КодПоОКАТО", СведенияОНалоговомОрганеПоАдресу.КодПоОКАТО);
		ДанныеГосРеестра.РегистрацияВНалоговомОргане.Вставить("КодПоОКТМО", СведенияОНалоговомОрганеПоАдресу.КодПоОКТМО);
	КонецЕсли;
	
КонецПроцедуры

Функция НаименованиеПлательщикаПоУмолчанию(ДанныеГосРеестра)
	
	// Для организации заполняем из полного наименования
	Если ДанныеГосРеестра.ЭтоЮрЛицо Тогда
		Возврат ДанныеГосРеестра.НаименованиеПолное;
	КонецЕсли;
	
	// Для ИП:
	// п.4 Приложения 1 к Приказу Минфина 107н:
	// Фамилия имя отчество "(ИП)" "//"Адрес регистрации"//"
	Шаблон = "%1 (ИП) //%2//";
	
	ФИО = ДанныеГосРеестра.Фамилия 
	+ ?(ПустаяСтрока(ДанныеГосРеестра.Имя), "", " " + ДанныеГосРеестра.Имя) 
	+ ?(ПустаяСтрока(ДанныеГосРеестра.Отчество), "", " " + ДанныеГосРеестра.Отчество);
	АдресРегистрации = ДанныеГосРеестра.ЮридическийАдрес;
	
	Возврат СтрШаблон(Шаблон, ФИО, АдресРегистрации);
	
КонецФункции

#КонецОбласти

Функция ПоказатьВыборДемоПриложений()
	
	НачальнуюСтраницуНужноЗаменить = РабочийСтолУНФ.ТребуетсяУстановитьРабочийСтолПользователя()
	Или РабочийСтолУНФ.УстановленаПустаяНачальнаяСтраница();
	
	Возврат ПолучитьФункциональнуюОпцию("ПоказыватьВыборДемоКомбинированныхПриложений") И НачальнуюСтраницуНужноЗаменить;
	
КонецФункции

Функция ПоказатьОкноНачалаРаботыИлиВыбораДемоПриложений()
	
	Если Не ПервыйВходВПрограммуЗафиксирован() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат ПоказатьВыборДемоПриложений();
	
КонецФункции

Функция ПользовательПустой(Пользователь)
	
	Возврат СтрНайти(Строка(Пользователь), "<Не указан>") <> 0;
	
КонецФункции

#КонецОбласти
